syoyo/solaris-infiniband-tools/oi151a/sfw/packages/i386/nightly-nd/SUNWofusr/reloc/usr/share/man/man1m/iblinkinfo.1m
'\" t
.\"
.\" Modified for Solaris to to add the Solaris stability classification,
.\" and to add a note about source availability.
.\" 
.TH IBLINKINFO 1m "Jan 24, 2008" "OpenIB" "OpenIB Diagnostics"

.SH NAME
iblinkinfo.pl \- report link info for all links in the fabric

.SH SYNOPSIS
.B iblinkinfo.pl
   [-Rhcdl -C <ca_name> -P <ca_port> -v <lt,hoq,vlstall> -S <guid> -D <direct_route>]

.SH DESCRIPTION
.PP
iblinkinfo.pl reports the link info for each port of each switch active in the
IB fabric.

.SH OPTIONS

.PP
.TP
\fB\-R\fR
Recalculate the ibnetdiscover information, ie do not use the cached
information.  This option is slower but should be used if the diag tools have
not been used for some time or if there are other reasons to believe the
fabric has changed.
.TP
\fB\-S <guid>\fR
Output only the switch specified by <guid>
.TP
\fB\-D <direct_route>\fR
Output only the switch specified by the direct route path.
.TP
\fB\-l\fR
Print all information for each link on one line. Default is to print a header
with the switch information and then a list for each port (useful for grep\'ing output).
.TP
\fB\-d\fR
Print only switches which have a port in the "Down" state.
.TP
\fB\-v <lt,hoq,vlstall>\fR
Verify additional switch settings (<LifeTime>,<HoqLife>,<VLStallCount>)
.TP
\fB\-c\fR
Print port capabilities (enabled and supported values)
.TP
\fB\-C <ca_name>\fR    use the specified ca_name for the search.
.TP
\fB\-P <ca_port>\fR    use the specified ca_port for the search.


.SH AUTHOR
.TP
Ira Weiny
.RI < weiny2@llnl.gov >
.\" Begin Sun update
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Availability	network/open-fabrics
_
Interface Stability	Volatile
.TE 
.PP
.SH NOTES
Source for OFED is available from http://www.openfabrics.org/.
.\" End Sun update
