syoyo/solaris-infiniband-tools/oi151a/sfw/packages/i386/nightly-nd/SUNWofusr/reloc/usr/share/man/man1m/ibroute.1m
'\" t
.\"
.\" Modified for Solaris to to add the Solaris stability classification,
.\" and to add a note about source availability.
.\" 
.TH IBROUTE 1m "July 25, 2006" "OpenIB" "OpenIB Diagnostics"

.SH NAME
ibroute \- query InfiniBand switch forwarding tables

.SH SYNOPSIS
.B ibroute
[\-d(ebug)] [-a(ll)] [-n(o_dests)] [-v(erbose)] [\-D(irect)] [\-G(uid)] [-M(ulticast)] [-s smlid] [\-C ca_name] [\-P ca_port] [\-t(imeout) timeout_ms] [\-V(ersion)] [\-h(elp)] [<dest dr_path|lid|guid> [<startlid> [<endlid>]]]

.SH DESCRIPTION
.PP
ibroute uses SMPs to display the forwarding tables (unicast
(LinearForwardingTable or LFT) or multicast (MulticastForwardingTable or MFT))
for the specified switch LID and the optional lid (mlid) range.
The default range is all valid entries in the range 1...FDBTop.

.SH OPTIONS

.PP
.TP
\fB\-a\fR, \fB\-\-all\fR
show all lids in range, even invalid entries
.TP
\fB\-n\fR, \fB\-\-no_dests\fR
do not try to resolve destinations
.TP
\fB\-M\fR, \fB\-\-Multicast\fR
show multicast forwarding tables
In this case, the range parameters are specifying the mlid range.

.SH COMMON OPTIONS

Most OpenIB diagnostics take the following common flags. The exact list of
supported flags per utility can be found in the usage message and can be shown
using the util_name -h syntax.

# Debugging flags
.PP
\-d      raise the IB debugging level.
        May be used several times (-ddd or -d -d -d).
.PP
\-e      show send and receive errors (timeouts and others)
.PP
\-h      show the usage message
.PP
\-v      increase the application verbosity level.
        May be used several times (-vv or -v -v -v)
.PP
\-V      show the version info.

# Addressing flags
.PP
\-D      use directed path address arguments. The path
        is a comma separated list of out ports.
        Examples:
        "0"             # self port
        "0,1,2,1,4"     # out via port 1, then 2, ...
.PP
\-G      use GUID address argument. In most cases, it is the Port GUID.
        Example:
        "0x08f1040023"
.PP
\-s <smlid>      use 'smlid' as the target lid for SM/SA queries.

# Other common flags:
.PP
\-C <ca_name>    use the specified ca_name.
.PP
\-P <ca_port>    use the specified ca_port.
.PP
\-t <timeout_ms> override the default timeout for the solicited mads.

Multiple CA/Multiple Port Support

When no IB device or port is specified, the port to use is selected
by the following criteria:
.PP
1. the first port that is ACTIVE.
.PP
2. if not found, the first port that is UP (physical link up).

If a port and/or CA name is specified, the user request is
attempted to be fulfilled, and will fail if it is not possible.

.SH EXAMPLES

.PP
Unicast examples
.PP
ibroute 4       # dump all lids with valid out ports of switch with lid 4
.PP
ibroute -a 4    # same, but dump all lids, even with invalid out ports
.PP
ibroute -n 4    # simple dump format - no destination resolution
.PP
ibroute 4 10    # dump lids starting from 10 (up to FDBTop)
.PP
ibroute 4 0x10 0x20     # dump lid range
.PP
ibroute -G 0x08f1040023 # resolve switch by GUID
.PP
ibroute -D 0,1  # resolve switch by direct path

.PP
Multicast examples
.PP
ibroute -M 4    # dump all non empty mlids of switch with lid 4
.PP
ibroute -M 4 0xc010 0xc020      # same, but with range
.PP
ibroute -M -n 4 # simple dump format

.SH SEE ALSO
.BR ibtracert (1m)

.SH AUTHOR
.TP
Hal Rosenstock
.RI < halr@voltaire.com >
.\" Begin Sun update
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Availability	network/open-fabrics
_
Interface Stability	Volatile
.TE 
.PP
.SH NOTES
Source for OFED is available from http://www.openfabrics.org/.
.\" End Sun update
