syoyo/solaris-infiniband-tools/oi151a/sfw/packages/i386/nightly-nd/SUNWofusr/reloc/usr/share/man/man1m/saquery.1m
'\" t
.\"
.\" Modified for Solaris to to add the Solaris stability classification,
.\" and to add a note about source availability.
.\" 
.TH SAQUERY 1m "April 13, 2007" "OpenIB" "OpenIB Diagnostics"

.SH NAME
saquery \- query InfiniBand subnet administration attributes

.SH SYNOPSIS
.B saquery
[\-h] [\-d] [\-p] [\-N] [\-\-list | \-D] [\-S] [\-I] [\-L] [\-l] [\-G] [\-O]
[\-U] [\-c] [\-s] [\-g] [\-m] [\-x]
[\-C ca_name] [\-P ca_port] [\-t(imeout) <msec>]
[\-\-src\-to\-dst <src:dst>]
[\-\-sgid\-to\-dgid <sgid\-dgid>]
[\-\-node\-name\-map <node\-name\-map>]
[<name> | <lid> | <guid>]

.SH DESCRIPTION
.PP
saquery issues the selected SA query. Node records are queried by default.

.SH OPTIONS

.PP
.TP
\fB\-p\fR
get PathRecord info
.TP
\fB\-N\fR
get NodeRecord info
.TP
\fB\-\-list | \-D\fR
get NodeDescriptions of CAs only
.TP
\fB\-S\fR
get ServiceRecord info
.TP
\fB\-I\fR
get InformInfoRecord (subscription) info
.TP
\fB\-L\fR
return the Lids of the name specified
.TP
\fB\-l\fR
return the unique Lid of the name specified
.TP
\fB\-G\fR
return the Guids of the name specified
.TP
\fB\-O\fR
return the name for the Lid specified
.TP
\fB\-U\fR
return the name for the Guid specified
.TP
\fB\-c\fR
get the SA's class port info
.TP
\fB\-s\fR
return the PortInfoRecords with isSM or isSMdisabled capability mask bit on
.TP
\fB\-g\fR
get multicast group info
.TP
\fB\-m\fR
get multicast member info.  If a group is specified, limit the output to the
group specified and print one line containing only the GUID and node
description for each entry. Example: saquery -m 0xc000
.TP
\fB\-x\fR
get LinkRecord info
.TP
\fB\-\-src-to-dst\fR
get a PathRecord for <src:dst>
where src and dst are either node names or LIDs
.TP
.B \-\-sgid\-to\-dgid
get a PathRecord for
.I sgid
to
.I dgid
where both GIDs are in an IPv6 format acceptable to
.BR inet_pton (3).
.TP
\fB\-C\fR <ca_name>
use the specified ca_name.
.TP
\fB\-P\fR <ca_port>
use the specified ca_port.
.TP
\fB\-t\fR, \fB\-timeout\fR <msec>
Specify SA query response timeout in milliseconds.
Default is 100 milliseconds. You may want to use
this option if IB_TIMEOUT is indicated.
.TP
\fB\-\-node\-name\-map\fR <node-name-map>
Specify a node name map.  The node name map file maps GUIDs to more user friendly
names.  See
.B ibnetdiscover(1m)
for node name map file format.  Only used with the \fB\-O\fR and \fB\-U\fR options.
.TP
\fB\-d\fR
enable debugging
.TP
\fB\-h\fR
show help

.SH AUTHORS
.TP
Ira Weiny
.RI < weiny2@llnl.gov >
.TP
Hal Rosenstock
.RI < halr@voltaire.com >
.\" Begin Sun update
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Availability	network/open-fabrics
_
Interface Stability	Volatile
.TE 
.PP
.SH NOTES
Source for OFED is available from http://www.openfabrics.org/.
.\" End Sun update
